{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "лаб 4.2.16.ipynb",
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "ltMve6xA3Aex"
      },
      "source": [
        "№ 4.2.16\n",
        "\n",
        "В области несколько районов. Заданы площади, засеваемые пшеницей (га.), и средняя урожайность (ц/га) в каждом районе.\n",
        "\n",
        "Определите количество пшеницы, собранное по области. При выводе вещественных результатов оставьте один знак после запятой."
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "S6Qap3D9283g",
        "outputId": "e5f46c68-5b3e-4686-cae0-7e9a1323e4dd",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 255
        }
      },
      "source": [
        "# Программирование на языке высокого уровня (Python).\n",
        "# https://www.yuripetrov.ru/edu/python\n",
        "# Задание task_04_02_16.\n",
        "#\n",
        "# Выполнил: Сафина\n",
        "\n",
        "# Группа: !!!\n",
        "# E-mail: !!!\n",
        " \n",
        "\n",
        "n = int(input(' Количество районов = '))\n",
        "i=1\n",
        "x=0\n",
        "while i<=n:\n",
        " l=int(input(print('Площадь ',i,'-го района (га) = ')))\n",
        " m=int(input(print(' Урожайность в ',i,'-м районе (ц/га) = ')))\n",
        " i=i+1\n",
        " x= x +l*m\n",
        "total = round(x,1)\n",
        "print(\"Собрано пшеницы: {:.1f} ц.\".format(total))\n",
        "\n",
        "# Удалите комментарий и допишите код\n",
        "\n",
        "# --------------\n",
        "# Пример вывода:\n",
        "#\n",
        "# Количество районов = 3\n",
        "# Площадь 1-го района (га) = 4\n",
        "# Урожайность в 1-м районе (ц/га.) = 2\n",
        "# Площадь 2-го района (га) = 7\n",
        "# Урожайность в 2-м районе (ц/га.) = 3\n",
        "# Площадь 3-го района (га) = 9\n",
        "# Урожайность в 3-м районе (ц/га.) = 4\n",
        "# Собрано пшеницы: 65.0 ц.\n"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            " Количество районов = 3\n",
            "Площадь  1 -го района (га) = \n",
            "4\n",
            " Урожайность в  1 -м районе (ц/га) = \n",
            "2\n",
            "Площадь  2 -го района (га) = \n",
            "3\n",
            " Урожайность в  2 -м районе (ц/га) = \n",
            "7\n",
            "Площадь  3 -го района (га) = \n",
            "9\n",
            " Урожайность в  3 -м районе (ц/га) = \n",
            "4\n",
            "Собрано пшеницы: 65.0 ц.\n"
          ],
          "name": "stdout"
        }
      ]
    }
  ]
}